Revit 2027 API
ParameterTypeId.FabricationProductDataLongDescription Property
 "Product Long Description"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FabricationProductDataLongDescription { get; }
Public Shared ReadOnly Property FabricationProductDataLongDescription As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FabricationProductDataLongDescription {
	ForgeTypeId^ get ();
}
static member FabricationProductDataLongDescription : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace